{
    "RuleId":  "a793a0b4-e3bd-411a-9c08-d6f0bb0a7123\u0027)]",
    "DisplayName":  "Java Executing cmd to run Powershell",
    "Description":  "This query was originally published in the threat analytics report, Sysrv botnet evolution.\nSysrv is a Go-based botnet that targets both Windows and Linux servers, and steals resources to mine cryptocurrency.\nThe following query finds instances of the Java process being used to execute cmd.exe, and download and execute a PowerShell script.",
    "Severity":  "High",
    "Enabled":  true,
    "Query":  "DeviceProcessEvents                         \n| where InitiatingProcessFileName == \u0027java.exe\u0027 and FileName == \u0027cmd.exe\u0027 \nand ProcessCommandLine has_all(\u0027powershell iex\u0027,\u0027DownloadString\u0027)\n| extend HostName = iff(DeviceName has \u0027.\u0027, substring(DeviceName, 0, indexof(DeviceName, \u0027.\u0027)), DeviceName)\n| extend DnsDomain = iff(DeviceName has \u0027.\u0027, substring(DeviceName, indexof(DeviceName, \u0027.\u0027) + 1), \"\")\n",
    "QueryFrequency":  "PT1H",
    "QueryPeriod":  "PT1H",
    "TriggerOperator":  "GreaterThan",
    "TriggerThreshold":  0,
    "SuppressionDuration":  "PT1H",
    "SuppressionEnabled":  false,
    "Tactics":  [
                    "Execution"
                ],
    "Techniques":  [
                       "T1059"
                   ],
    "SubTechniques":  [

                      ],
    "AlertRuleTemplateName":  "2c81c0a0-9823-4a14-b21a-2b4acd3335d2",
    "TemplateVersion":  "1.0.0",
    "EntityMappings":  [
                           {
                               "entityType":  "Host",
                               "fieldMappings":  [
                                                     {
                                                         "identifier":  "FullName",
                                                         "columnName":  "DeviceName"
                                                     },
                                                     {
                                                         "identifier":  "HostName",
                                                         "columnName":  "HostName"
                                                     },
                                                     {
                                                         "identifier":  "DnsDomain",
                                                         "columnName":  "DnsDomain"
                                                     }
                                                 ]
                           }
                       ],
    "CustomDetails":  null,
    "IncidentConfiguration":  {
                                  "createIncident":  true,
                                  "groupingConfiguration":  {
                                                                "enabled":  false,
                                                                "reopenClosedIncident":  false,
                                                                "lookbackDuration":  "PT5H",
                                                                "matchingMethod":  "AllEntities",
                                                                "groupByEntities":  [

                                                                                    ],
                                                                "groupByAlertDetails":  [

                                                                                        ],
                                                                "groupByCustomDetails":  [

                                                                                         ]
                                                            }
                              },
    "EventGroupingSettings":  {
                                  "aggregationKind":  "SingleAlert"
                              },
    "Kind":  "Scheduled",
    "ApiVersion":  "2023-12-01-preview",
    "SourceFile":  "Azure_Sentinel_analytics_rules (12).json",
    "VersionHistory":  [
                           {
                               "Date":  "2025-05-22 16:19:22",
                               "Version":  "1.0",
                               "Action":  "Created",
                               "Changes":  [

                                           ],
                               "UpdatedBy":  "NoahBournes"
                           }
                       ],
    "LastUpdated":  "2025-05-22 16:19:22",
    "CurrentVersion":  "1.0",
    "OriginTenant":  "Crisk"
}
