{
    "RuleId":  "5cbb3241-c04b-450b-b04b-eda4c2cc1e17\u0027)]",
    "DisplayName":  "LaZagne Credential Theft",
    "Description":  "LaZagne is a popular open-source tool used to recover passwords stored on a local computer. It has been used in ransomware attacks to steal credentials and escalate privileges. This query looks for the execution of LaZagne.",
    "Severity":  "Medium",
    "Enabled":  true,
    "Query":  "DeviceProcessEvents \n| where FileName =~ \u0027reg.exe\u0027\n| where ProcessCommandLine has_all(\u0027save\u0027,\u0027hklm\u0027,\u0027sam\u0027)\n| project DeviceId, DeviceName, TimeGenerated, InitiatingProcessId, InitiatingProcessFileName, ProcessId, FileName, ProcessCommandLine\n| extend HostName = iff(DeviceName has \u0027.\u0027, substring(DeviceName, 0, indexof(DeviceName, \u0027.\u0027)), DeviceName)\n| extend DnsDomain = iff(DeviceName has \u0027.\u0027, substring(DeviceName, indexof(DeviceName, \u0027.\u0027) + 1), \"\")\n",
    "QueryFrequency":  "PT1H",
    "QueryPeriod":  "PT1H",
    "TriggerOperator":  "GreaterThan",
    "TriggerThreshold":  0,
    "SuppressionDuration":  "PT1H",
    "SuppressionEnabled":  false,
    "Tactics":  [
                    "CredentialAccess"
                ],
    "Techniques":  [
                       "T1003"
                   ],
    "SubTechniques":  [

                      ],
    "AlertRuleTemplateName":  "7d0d3050-8dac-4b83-bfae-902f7dc0c21c",
    "TemplateVersion":  "1.0.0",
    "EntityMappings":  [
                           {
                               "entityType":  "Host",
                               "fieldMappings":  [
                                                     {
                                                         "identifier":  "FullName",
                                                         "columnName":  "DeviceName"
                                                     },
                                                     {
                                                         "identifier":  "HostName",
                                                         "columnName":  "HostName"
                                                     },
                                                     {
                                                         "identifier":  "DnsDomain",
                                                         "columnName":  "DnsDomain"
                                                     }
                                                 ]
                           },
                           {
                               "entityType":  "Process",
                               "fieldMappings":  [
                                                     {
                                                         "identifier":  "ProcessId",
                                                         "columnName":  "ProcessId"
                                                     },
                                                     {
                                                         "identifier":  "CommandLine",
                                                         "columnName":  "ProcessCommandLine"
                                                     }
                                                 ]
                           }
                       ],
    "CustomDetails":  null,
    "IncidentConfiguration":  {
                                  "createIncident":  true,
                                  "groupingConfiguration":  {
                                                                "enabled":  false,
                                                                "reopenClosedIncident":  false,
                                                                "lookbackDuration":  "PT5H",
                                                                "matchingMethod":  "AllEntities",
                                                                "groupByEntities":  [

                                                                                    ],
                                                                "groupByAlertDetails":  [

                                                                                        ],
                                                                "groupByCustomDetails":  [

                                                                                         ]
                                                            }
                              },
    "EventGroupingSettings":  {
                                  "aggregationKind":  "SingleAlert"
                              },
    "Kind":  "Scheduled",
    "ApiVersion":  "2023-12-01-preview",
    "SourceFile":  "Azure_Sentinel_analytics_rules (12).json",
    "VersionHistory":  [
                           {
                               "Date":  "2025-05-22 16:19:22",
                               "Version":  "1.0",
                               "Action":  "Created",
                               "Changes":  [

                                           ],
                               "UpdatedBy":  "NoahBournes"
                           }
                       ],
    "LastUpdated":  "2025-05-22 16:19:22",
    "CurrentVersion":  "1.0",
    "OriginTenant":  "Crisk"
}
