{
    "RuleId":  "300bf73a-2bbb-4382-a3ce-9b3da18b1923\u0027)]",
    "DisplayName":  "Bulk Changes to Privileged Account Permissions",
    "Description":  "Identifies when changes to multiple users permissions are changed at once. Investigate immediately if not a planned change. This setting could enable an attacker access to Azure subscriptions in your environment.\nRef : https://docs.microsoft.com/azure/active-directory/fundamentals/security-operations-privileged-identity-management",
    "Severity":  "High",
    "Enabled":  true,
    "Query":  "let AdminRecords = AuditLogs\n| where Category =~ \"RoleManagement\"\n| where ActivityDisplayName has_any (\"Add eligible member to role\", \"Add member to role\")\n| mv-apply TargetResource = TargetResources on \n  (\n      where TargetResource.type =~ \"User\"\n      | extend TargetUserPrincipalName = tostring(TargetResource.userPrincipalName),\n               props = TargetResource.modifiedProperties\n  )\n| mv-apply Property = props on \n  (\n      where Property.displayName =~ \"Role.DisplayName\"\n      | extend RoleName = trim(\u0027\"\u0027,tostring(Property.newValue))\n  )\n| where RoleName contains \"Admin\";\nAdminRecords\n| summarize dcount(TargetUserPrincipalName) by bin(TimeGenerated, 1h)\n| where dcount_TargetUserPrincipalName \u003e 9\n| join kind=rightsemi  (\n  AdminRecords\n  | extend TimeWindow = bin(TimeGenerated, 1h)\n) on $left.TimeGenerated == $right.TimeWindow\n| extend InitiatedByUser = iff(isnotempty(InitiatedBy.user.userPrincipalName), tostring(InitiatedBy.user.userPrincipalName), \"\")\n| extend InitiatingAppName = tostring(InitiatedBy.app.displayName)\n| extend InitiatingAppServicePrincipalId = tostring(InitiatedBy.app.servicePrincipalId)\n| extend InitiatingUserPrincipalName = tostring(InitiatedBy.user.userPrincipalName)\n| extend InitiatingAadUserId = tostring(InitiatedBy.user.id)\n| extend InitiatingIpAddress = tostring(iff(isnotempty(InitiatedBy.user.ipAddress), InitiatedBy.user.ipAddress, InitiatedBy.app.ipAddress))\n| extend TargetName = tostring(split(TargetUserPrincipalName,\u0027@\u0027,0)[0]), TargetUPNSuffix = tostring(split(TargetUserPrincipalName,\u0027@\u0027,1)[0])\n| extend InitiatingAccountName = tostring(split(InitiatingUserPrincipalName, \"@\")[0]), InitiatingAccountUPNSuffix = tostring(split(InitiatingUserPrincipalName, \"@\")[1])\n",
    "QueryFrequency":  "PT2H",
    "QueryPeriod":  "PT2H",
    "TriggerOperator":  "GreaterThan",
    "TriggerThreshold":  0,
    "SuppressionDuration":  "PT5H",
    "SuppressionEnabled":  false,
    "Tactics":  [
                    "PrivilegeEscalation"
                ],
    "Techniques":  [
                       "T1078"
                   ],
    "SubTechniques":  [
                          "T1078.004"
                      ],
    "AlertRuleTemplateName":  "218f60de-c269-457a-b882-9966632b9dc6",
    "TemplateVersion":  "1.0.7",
    "EntityMappings":  [
                           {
                               "entityType":  "Account",
                               "fieldMappings":  [
                                                     {
                                                         "identifier":  "Name",
                                                         "columnName":  "InitiatingAppName"
                                                     },
                                                     {
                                                         "identifier":  "AadUserId",
                                                         "columnName":  "InitiatingAppServicePrincipalId"
                                                     }
                                                 ]
                           },
                           {
                               "entityType":  "Account",
                               "fieldMappings":  [
                                                     {
                                                         "identifier":  "FullName",
                                                         "columnName":  "TargetUserPrincipalName"
                                                     },
                                                     {
                                                         "identifier":  "Name",
                                                         "columnName":  "TargetName"
                                                     },
                                                     {
                                                         "identifier":  "UPNSuffix",
                                                         "columnName":  "TargetUPNSuffix"
                                                     }
                                                 ]
                           },
                           {
                               "entityType":  "Account",
                               "fieldMappings":  [
                                                     {
                                                         "identifier":  "FullName",
                                                         "columnName":  "InitiatingUserPrincipalName"
                                                     },
                                                     {
                                                         "identifier":  "Name",
                                                         "columnName":  "InitiatingAccountName"
                                                     },
                                                     {
                                                         "identifier":  "UPNSuffix",
                                                         "columnName":  "InitiatingAccountUPNSuffix"
                                                     }
                                                 ]
                           },
                           {
                               "entityType":  "Account",
                               "fieldMappings":  [
                                                     {
                                                         "identifier":  "AadUserId",
                                                         "columnName":  "InitiatingAadUserId"
                                                     }
                                                 ]
                           },
                           {
                               "entityType":  "IP",
                               "fieldMappings":  [
                                                     {
                                                         "identifier":  "Address",
                                                         "columnName":  "InitiatingIpAddress"
                                                     }
                                                 ]
                           }
                       ],
    "CustomDetails":  {
                          "TargetUser":  "TargetUserPrincipalName",
                          "InitiatedByUser":  "InitiatedByUser"
                      },
    "IncidentConfiguration":  {
                                  "createIncident":  true,
                                  "groupingConfiguration":  {
                                                                "enabled":  false,
                                                                "reopenClosedIncident":  false,
                                                                "lookbackDuration":  "PT5M",
                                                                "matchingMethod":  "AllEntities",
                                                                "groupByEntities":  [

                                                                                    ],
                                                                "groupByAlertDetails":  null,
                                                                "groupByCustomDetails":  null
                                                            }
                              },
    "EventGroupingSettings":  {
                                  "aggregationKind":  "SingleAlert"
                              },
    "Kind":  "Scheduled",
    "ApiVersion":  "2023-12-01-preview",
    "SourceFile":  "Azure_Sentinel_analytics_rules (14).json",
    "VersionHistory":  [
                           {
                               "Date":  "2025-05-22 16:19:23",
                               "Version":  "1.0",
                               "Action":  "Created",
                               "Changes":  [

                                           ],
                               "UpdatedBy":  "NoahBournes"
                           }
                       ],
    "LastUpdated":  "2025-05-22 16:19:23",
    "CurrentVersion":  "1.0",
    "OriginTenant":  "Crisk"
}
