{
    "RuleId":  "c75b062c-ca25-46aa-82db-68a7f462b64e\u0027)]",
    "DisplayName":  "Threat Essentials - User Assigned Privileged Role",
    "Description":  "Identifies when a new privileged role is assigned to a user.  Any account eligible for a role is now being given privileged access. If the assignment is unexpected or into a role that isn\u0027t the responsibility of the account holder, investigate.\nRef : https://docs.microsoft.com/azure/active-directory/fundamentals/security-operations-privileged-accounts#things-to-monitor-1",
    "Severity":  "High",
    "Enabled":  true,
    "Query":  "AuditLogs\n| where Category =~ \"RoleManagement\"\n| where AADOperationType in~ (\"Assign\", \"AssignEligibleRole\")\n| where ActivityDisplayName has_any (\"Add eligible member to role\", \"Add member to role\")\n| mv-expand TargetResources\n| mv-expand TargetResources.modifiedProperties\n| extend displayName_ = tostring(TargetResources_modifiedProperties.displayName)\n| where displayName_ =~ \"Role.DisplayName\"\n| extend RoleName = tostring(parse_json(tostring(TargetResources_modifiedProperties.newValue)))\n| where RoleName contains \"Admin\"\n| extend InitiatingApp = tostring(parse_json(tostring(InitiatedBy.app)).displayName)\n| extend Initiator = iif(isnotempty(InitiatingApp), InitiatingApp, tostring(parse_json(tostring(InitiatedBy.user)).userPrincipalName))\n| extend Target = tostring(TargetResources.userPrincipalName)\n| summarize by bin(TimeGenerated, 1h), OperationName,  RoleName, Target, Initiator, Result\n| extend InitiatorName=split(Initiator, \"@\")[0], InitiatorUPNSuffix=split(Initiator, \"@\")[1]\n| extend TargetName=split(Target, \"@\")[0], TargetUPNSuffix=split(Target, \"@\")[1]\n",
    "QueryFrequency":  "PT2H",
    "QueryPeriod":  "PT2H",
    "TriggerOperator":  "GreaterThan",
    "TriggerThreshold":  0,
    "SuppressionDuration":  "PT1H",
    "SuppressionEnabled":  false,
    "Tactics":  [
                    "Persistence"
                ],
    "Techniques":  [
                       "T1078"
                   ],
    "SubTechniques":  [
                          "T1078.004"
                      ],
    "AlertRuleTemplateName":  "b09795c9-8dce-47ab-8f75-5a4afb78ef0c",
    "TemplateVersion":  "1.0.3",
    "EntityMappings":  [
                           {
                               "entityType":  "Account",
                               "fieldMappings":  [
                                                     {
                                                         "identifier":  "Name",
                                                         "columnName":  "InitiatorName"
                                                     },
                                                     {
                                                         "identifier":  "UPNSuffix",
                                                         "columnName":  "InitiatorUPNSuffix"
                                                     }
                                                 ]
                           },
                           {
                               "entityType":  "Account",
                               "fieldMappings":  [
                                                     {
                                                         "identifier":  "Name",
                                                         "columnName":  "TargetName"
                                                     },
                                                     {
                                                         "identifier":  "UPNSuffix",
                                                         "columnName":  "TargetUPNSuffix"
                                                     }
                                                 ]
                           }
                       ],
    "CustomDetails":  null,
    "IncidentConfiguration":  {
                                  "createIncident":  true,
                                  "groupingConfiguration":  {
                                                                "enabled":  false,
                                                                "reopenClosedIncident":  false,
                                                                "lookbackDuration":  "PT5H",
                                                                "matchingMethod":  "AllEntities",
                                                                "groupByEntities":  [

                                                                                    ],
                                                                "groupByAlertDetails":  [

                                                                                        ],
                                                                "groupByCustomDetails":  [

                                                                                         ]
                                                            }
                              },
    "EventGroupingSettings":  {
                                  "aggregationKind":  "SingleAlert"
                              },
    "Kind":  "Scheduled",
    "ApiVersion":  "2023-12-01-preview",
    "SourceFile":  "Azure_Sentinel_analytics_rules (12).json",
    "VersionHistory":  [
                           {
                               "Date":  "2025-05-22 16:19:21",
                               "Version":  "1.0",
                               "Action":  "Created",
                               "Changes":  [

                                           ],
                               "UpdatedBy":  "NoahBournes"
                           }
                       ],
    "LastUpdated":  "2025-05-22 16:19:21",
    "CurrentVersion":  "1.0",
    "OriginTenant":  "Crisk"
}
